# Завдання №1

# Введення трьох цифр
a = int(input("Введіть першу цифру: "))
b = int(input("Введіть другу цифру: "))
c = int(input("Введіть третю цифру: "))

# Обчислення суми та добутку чисел
sum = a + b + c
product = a * b * c

# Виведення результатів обчислень
print("Сума чисел:", sum)
print("Добуток чисел:", product)

# Завдання №2

# Введення довжини двох діагоналей ромба
a = float(input("Введіть довжину першої діагоналі: "))
b = float(input("Введіть довжину другої діагоналі: "))

# Обчислення площі ромба
area = (a * b) / 2

# Виведення результату обчислень
print("Площа ромба:", area)

# Завдання №3

# Введення числа
number = input("Введіть число: ")

# Перетворення числа в список цифр
digits = list(number)

# Обчислення добутку цифр
product = 1
for digit in digits:
    product *= int(digit)

# Виведення результату обчислень
print("Добуток цифр числа:", product)
